"""
1.面向过程：根据业务逻辑从上到下写代码，按照解决问题的步骤写代码
在思考问题的时候，怎么按步骤去实现，亲历亲为的去做
将问题解决拆解成若干个步骤，并将这些步骤对应成方法一步步的最终完成

2.函数式：将某功能代码封装到函数中，无需重复的编写，仅调用函数以实现特定功能
3.面向对象编程 object oriented programming(oop)：
是一种python的编程思路，将数据与函数绑定到一起，进行封装，这样能够更快速的开发程序
减少了重复代码的编写过程，它关注的是设计的思维，面向帮手编程，什么事情不用亲历亲为，交给各个帮手以完成任务

4.从计算机角度，面向过程不适合做大项目，面向对象适合做更大的项目设计
面向过程的关注点是：怎么做
面向对象的关注点是：谁来做（对象）

5面向对象编程 object oriented programming(oop)：
定义:是一种解决软件复用的设计和编程方法。这种方法把软件系统中相近相似的
操作逻辑和操作应用数据，状态，以类的形式描述出来，以对象实例的形式在软件系统
中复用，以达到提高软件开发效率的作用




"""